[1,["ee0pcqQxRL95xLN35ecCLR@f9941","20g1ukYUVPvKWKBRznAKo+@f9941","54TknWPwVPqJqeCR+Y/Czo@f9941","95EkngnxZFbYuFpsqVTaFr@f9941","ffuIqPr2JI9I8dPLYGRDpD@f9941","5bIcQojPZABLN+FCGpB3LW@f9941","afxHkx8GZGsJC+n+YfITQo@f9941"],["node","_spriteFrame","_normalSprite","_hoverSprite","_pressedSprite","_disabledSprite","root","content","scrollView","_target","_handle","_scrollView","data","_parent"],[["cc.Node",["_name","_layer","_active","_components","_prefab","_parent","_children","_lpos","_lscale"],0,9,4,1,2,5,5],["cc.Widget",["_alignFlags","_alignMode","_top","_right","_originalHeight","_originalWidth","node","__prefab"],-3,1,4],["cc.Sprite",["_type","_sizeMode","node","__prefab","_spriteFrame"],1,1,4,6],["cc.Node",["_name","_layer","_parent","_components","_prefab","_lpos","_children"],1,1,12,4,5,2],["cc.UITransform",["node","__prefab","_contentSize","_anchorPoint"],3,1,4,5,5],["cc.Prefab",["_name"],2],["cc.CompPrefabInfo",["fileId"],2],["cc.Label",["_string","_actualFontSize","_fontSize","_lineHeight","_isBold","_enableOutline","node","__prefab","_outlineColor"],-3,1,4,5],["cc.PrefabInfo",["fileId","instance","targetOverrides","nestedPrefabInstanceRoots","root","asset"],-1,1,1],["cc.Button",["_transition","node","__prefab","_normalColor","_target","_normalSprite","_hoverSprite","_pressedSprite","_disabledSprite"],2,1,4,5,1,6,6,6,6],["cc.ScrollBar",["_direction","node","__prefab","_scrollView","_handle"],2,1,4,1,1],["cc.ScrollView",["bounceDuration","brake","horizontal","node","__prefab","_content"],0,1,4,1],["cc.Mask",["node","__prefab"],3,1,4],["cc.Graphics",["node","__prefab","_fillColor"],3,1,4,5],["cc.RichText",["_lineHeight","_string","_horizontalAlign","_fontSize","_maxWidth","node","__prefab"],-2,1,4],["cc.Layout",["_layoutType","_isAlign","node","__prefab"],1,1,4],["ece5daPUV1IVZFgI1j/wfmv",["node","__prefab","scrollView","content"],3,1,4,1,1]],[[6,0,2],[8,0,1,2,3,4,5,5],[4,0,1,2,3,1],[4,0,1,2,1],[14,0,1,2,3,4,5,6,6],[0,0,2,1,5,3,4,7,4],[0,0,1,6,3,4,3],[0,0,1,5,3,4,7,3],[0,0,2,1,5,3,4,4],[1,0,5,4,6,7,4],[2,0,1,2,3,3],[2,0,1,2,3,4,3],[5,0,2],[0,0,1,5,6,3,4,3],[0,0,1,5,6,3,4,7,8,3],[0,0,1,5,6,3,4,7,3],[3,0,1,2,6,3,4,5,3],[3,0,1,2,3,4,5,3],[7,0,1,2,3,4,5,6,7,8,7],[1,0,2,1,6,7,4],[1,0,3,2,1,6,7,5],[1,0,3,4,1,6,7,5],[2,0,2,3,4,2],[9,0,1,2,3,4,5,6,7,8,2],[10,0,1,2,3,4,2],[11,0,1,2,3,4,5,4],[12,0,1,1],[13,0,1,2,1],[15,0,1,2,3,3],[16,0,1,2,3,1]],[[12,"PrivacyPolicyPage"],[6,"PrivacyPolicyPage",33554432,[-7],[[3,-2,[0,"d2+n1oNPVKrpgWP7GaKavf"],[5,720,1600]],[9,45,100,100,-3,[0,"da8GHXM+hCc4tfnTZUy9k+"]],[29,-6,[0,"aegl/vsU1L0IVUebrC4XWB"],-5,-4]],[1,"c46/YsCPVOJYA4mWEpNYRx",null,null,null,-1,0]],[6,"content",33554432,[-10,-11,-12,-13,-14],[[2,-8,[0,"1d5ENPg+9Cw4YvNJuZo6lN"],[5,600,10232.5],[0,0.5,1]],[28,2,true,-9,[0,"31lVeWUW1NnpDdakMHK5tY"]]],[1,"39PdRCnwxLbaGmRTv2xjSN",null,null,null,1,0]],[13,"ContentUI",33554432,1,[-17,-18,-19],[[3,-15,[0,"30nUvR2PZKzplldKZRuArN"],[5,688,988]],[11,1,0,-16,[0,"5982JAV8FF1q0AjzR/MHyb"],6]],[1,"2euaQLkcVGZI+onR+22/p6",null,null,null,1,0]],[7,"CloseBtn",33554432,3,[[3,-20,[0,"70WvYFCgRIYo9quB6NDUS6"],[5,93,95]],[22,1,-21,[0,"0dNwANPFlDXYjF95KI+4tA"],0],[23,3,-23,[0,"45VsXhqIxOdKT3qVGVjUSC"],[4,4292269782],-22,1,2,3,4],[20,33,-24.80499999999995,54.246000000000095,1,-24,[0,"86Ti8ciSdNxbn78gGVzqjp"]]],[1,"050NPuC4ZMj6CQq/3815gO",null,null,null,1,0],[1,322.30499999999995,392.2539999999999,0]],[16,"ScrollView",33554432,3,[-28,-29],[[[3,-25,[0,"5djIVvyldGvqn6WZ0egfxk"],[5,600,788]],[10,1,0,-26,[0,"18QAi3zbFPK6MiwcIKHBrg"]],-27],4,4,1],[1,"85bJCH/G9NjI7fOVkfvpYG",null,null,null,1,0],[1,0,-57.235000000000014,0]],[14,"scrollBar",33554432,5,[-36],[[2,-30,[0,"39C0f3AflMErpcwaEFFVwy"],[5,12,1125.7142857142858],[0,1,0.5]],[11,1,0,-31,[0,"14FuacYFJN1Z4yhhbbgUpB"],5],[21,37,-23.46900000000005,250,1,-32,[0,"8bak5UM5ZIn7raSMIxMvEV"]],[24,1,-35,[0,"f2ZDYRdhBCg5QWB6eeDR6P"],-34,-33]],[1,"feLZI/sJ5Am6LCEPtGgx4k",null,null,null,1,0],[1,323.46900000000005,0,0],[1,0.5,0.7,1]],[15,"view",33554432,5,[2],[[2,-37,[0,"a4B7seX85BraeiZznYKcMH"],[5,600,788],[0,0.5,1]],[26,-38,[0,"ef/Me584VMCKuJVIFtWppW"]],[27,-39,[0,"b4C6/tB8dPz4dLadqcMK5w"],[4,16777215]],[9,45,600,688,-40,[0,"58nOvewRlENrTwtCroVC92"]]],[1,"93FAwLDnpLwbcAa+mShtqd",null,null,null,1,0],[1,0,394,0]],[7,"TitleLabel",33554432,3,[[3,-41,[0,"27Mb+tx1FL0L1glNV7dGtJ"],[5,224,73.3]],[18,"隐私协议",55,55,55,true,true,-42,[0,"b7os8WDOhCNbBYFFy84uph"],[4,4293956141]],[19,17,16.29599999999992,1,-43,[0,"354T1U2cdIsYOpanBUuUBj"]]],[1,"86lLqSaoBGMYtjS0/VD2Tj",null,null,null,1,0],[1,0,441.0540000000001,0]],[17,"bar",33554432,6,[[[2,-44,[0,"741cJ90fJMXLWb/wMcFiA3"],[5,10,156.25],[0,0,0]],-45],4,1],[1,"60VVzWRZBAkbhrFM4D1Ix4",null,null,null,1,0],[1,-11,-31.25,0]],[25,0.23,0.75,false,5,[0,"841jJJtx1EabggDnyNJM5v"],2],[8,"RichText-003",false,33554432,2,[[2,-46,[0,"d8x6Mar51ECIjkySLAzKk1"],[5,600,1106.5],[0,0.5,1]],[4,25,"《收纳超级世界》隐私政策\n更新日期：2025年8月11日\n生效日期：2025年8月11日\n引言\n欢迎您使用广东五方进通科技有限公司（以下简称“我们”或“公司”）提供的相关游戏产品和服务。我们非常重视保护用户的隐私信息，我们收集信息是为了向所有用户提供更好。我们在收集用户信息过程中，严格遵守法律法规，秉承正当、合法、必要的原则，最低限度收集和使用用户的隐私信息，以便为您提供更加安全、可靠的服务。我们将通过本隐私政策向您进一步细化说明您在使用我们产品或服务时，我们收集、使用、存储和共享个人信息的情况，以及您所享有的相关权利等事宜，本隐私政策是《用户许可及服务协议》的组成部分。本隐私政策与您所使用的产品及服务以及所享有的权利息息相关，希望您仔细阅读，了解个人信息类型与用途的对应关系等更加详尽的个人信息处理规则。特别是以粗体/粗体下划线标识的条款，您应重点阅读，在确认充分理解并同意后再开始使用。请注意我们会不时地检查并更新我们的政策，因此有关的措施会随之变化。权限说明：SSID：读取网络设置，维护网络运营安全、设备序列号：判断账号归属、存储：用于存储游戏的资源文件，下载游戏包等功能、电话信息：获取设备标识，用于生成游客账号、获取账号：获取账号用于登录游戏读系统日志：获取游戏错误日志，改进和优化游戏体验任务列表：获取游戏是否退到后台或者回到前台MAC地址：维护网络运营安全自启动：游戏中活动事件的推送，登陆游戏后才启动自启动应用列表：支付时判断是否已安装微信/支付宝IMEI：判断账号归属OAID：判断账号归属位置信息：以便让您能快速识别/添加/邀请附近的朋友Android ID :设备唯一标识，判断账号归属传感器：获取传感器，用于使游戏界面持续正面向上，改进旋转手机时的游戏体验加速度传感器：通过获取设备加速度信息识别摇一摇等动作，阻止第三方流氓广告ICCID、MEID、IMEI、IMSI、Android_id、MAC地址：为保障您正常使用我们的服务，维护游戏基础功能的正常运行，根据您的设备终端和网络状态优化本游戏产品性能，提升您的游戏体验并保障您的账号安全，我们会收集您的设备名称、设备类型、设备型号和版本、操作系统、系统属性、IP地址、运营商信息、Wi-Fi状态/参数，设备识别符（如IMEI、IMSI、MAC地址、Android ID、硬件序列号）、应用ID、网络类型、传感器信息等信息。请注意，单独的传感器信息不属于个人信息，我们也不会将传感器信息用于其他用途。注销账号：在您注销渠道账号时，渠道会停止使用并删除信息或对您的个人信息进行匿名化处理，法律法规另有规定的除外,如果需要注销自己的账号，请联系在线客服，客服会在收到请求后，3个工作日内完成用户的账号注销事宜,客服邮箱（188774113@qq.com）本隐私政策将帮助您了解如下内容：1.我们收集的信息2.我们如何使用信息3.您的权利4.信息存储5.我们如何保护您的个人信息6.我们如何分享、转让、披露您的个人信息7.网络信标和相关技术8.未成年人/儿童保护9.变更10.独立第三方及其SDK11.联系我们",1,20,600,-47,[0,"d4hyMQcLJE07hEi3St5Vex"]]],[1,"20qn21EgpAba7oL4nD9btM",null,null,null,1,0]],[5,"RichText",false,33554432,2,[[2,-48,[0,"3915RPXHtLgJ/+YW5okbNI"],[5,600,1756.5000000000002],[0,0.5,1]],[4,25,"1.我们收集的信息您在使用我们的产品或服务时，我们会根据您的授权，收集、储存和使用下列与您有关的信息，以便为您提供相应的游戏功能和优化服务体验，以及保障您的账户安全。如果您不提供或不授权我们收集某些相应的信息，可能无法成为我们的用户，或无法使用我们提供的某些功能，或者无法达到相关服务拟达到的效果。1.1 账号注册信息1.1.1 当您注册游戏账号时，系统将帮助用户向游戏发送一条请求短信，并依当地电信运营商标准收取基本短信通信费，不会产生额外费用。为发送上述短信，我们需要收集您的手机号码，并获取发送短信权限。1.1.2 为有效识别您的账号，用于标记您为该游戏账号用户，我们会收集您在注册账号时填写的昵称、上传的头像、注册邮箱信息。1.1.3 如您使用微信、QQ、百度或其他第三方账号（统称“第三方账号”）作为游戏账号关联登录游戏的，我们会收集您的微信账号、QQ号码、百度账号或其他第三方账号的唯一标识、昵称、头像，用于保存您的登录信息，方便您的授权管理，以便您在不同设备登录。当您使用第三方账号时，请您仔细阅读该第三方的用户协议和隐私政策。1.1.4 为满足相关法律法规政策及主管部门的要求，您应当进行实名验证，主动提供您的实名身份信息（包括姓名、身份证号码、照片）。基于技术发展，身份信息可能还包括指纹信息、人脸识别信息、虹膜识别信息、声音识别信息等生物识别信息，但除非生物识别信息为处理个人数据目的所必需且不能替代，并且根据法律法规之允许，我们不会收集您的生物识别信息。实名身份信息属于敏感信息，拒绝提供实名身份信息可能会导致您无法正常登录游戏，我们无法为您提供相应的服务，或在使用过程中收到相应的限制。1.2 日志或系统识别信息1.2.1 当您使用游戏服务时，我们会收集您的游戏日志信息，包括登录日志、物品日志、游戏对局信息、交友记录、访问内容、通讯时间及时长等，以便您能够在客户端查看您的游戏历史记录，同时用于游戏运营统计分析、客服投诉处理及其他游戏安全分析，并为提升您的游戏体验。1.2.2 为保障您正常使用我们的服务，维护游戏基础功能的正常运行，优化游戏产品性能，提升您的游戏体验并保障您的账号安全，我们会收集您的设备传感器、设备ID、设备名称、设备类型和版本、系统版本、IP地址、MAC地址、应用ID等信息。1.2.3 为识别用户设备，保障网络运营安全，更好适配游戏，提升用户体验，在您使用移动设备登录游戏时，我们会收集您的手机型号、系统类型、系统版本、设备屏幕尺寸等参数信息。1.2.4 为保证您的游戏账号安全，营造公平健康的游戏环境，我们会收集您的游戏识别信息、进程及游戏崩溃记录等信息，用于检测盗版、扫描外挂、防止作弊等。1.2.5 为方便收集局域网中各计算机及网络设备的MAC地址，以便用于后续的DHCP自动分配IP地址及网络问题排查上，我们将收集您设备的MAC地址。1.2.6 为更便捷的检查应用程序是否需要升级、清理和防病毒，我们会收集您设备的软件安装列表。1.3 充值消费信息1.3.1 当您使用游戏产品或服务的消费功能时，我们会收集您的充值记录、消费记录等信息，以便您查询您的交易记录，同时尽最大程度保护您的虚拟物品安全。充值记录、消费记录属于敏感信息，收集上述信息为实现游戏产品的消费功能所必须，否则将无法完成交易。1.4 实现某些产品功能或服务所需的信息1.4.1 若您希望展现您的游戏状态（具体包括但不限于您的登录状态、对战信息/状态、成就信息等），我们将根据您的授权，收集您的好友关系、您在游戏中的操作信息、游戏状态信息进行使用，并向您本人或其他用户或好友展示。我们会视游戏产品具体情况为您提供相关权限，以便您可以对是否展示前述相关信息进行相应设置。1.4.2 如您希望通过语音、视频与其他游戏玩家互动、参与直播，或分享您的游戏画面，在您授权同意后，游戏会访问您的麦克风、摄像头、照片、媒体内容，为您提供语音聊天、直播互动、分享等功能。1.4.3 如您希望与附近的游戏玩家互动，在您授权同意后，我们会通过IP地址、GPSWIFI等方式收集您的地理位置信息，用于寻找附近的游戏玩家，以便您与附近的玩家匹配、组队等。地理位置信息属于敏感信息，拒绝提供该信息只会导致您无法实现与附近的游戏玩家互动，但不影响您正常使用游戏的其他功能，您也可以随时取消您的地理位置信息授权。1.4.4 为加快游戏运行速度，节约用户流量，我们部分游戏产品或服务需要您授权读取存储空间。1.5 用户分享的信息1.5.1 当您在游戏中通过文字、图片、语音、视频及其他方式与其他玩家进行互动，我们可能会收集并保存您发送的上述信息内容，用于过滤色情、暴力、政治、辱骂、恶意广告等不当内容，以此净化游戏环境，维护健康的上网环境。1.5.2 您自行上传或存储的信息，包括您分享的内容及其所包含的元数据信息（例如您或其他人上传的显示您当前或曾经所处地理位置的共享信息，您或其他人共享的照片包含的地理标记信息）。1.5.3 您向我们的客服或参加我们活动时提交的信息，为更好地为您提供优质服务。1.5.4 其他用户分享的您的信息。1.5.5 如您不希望我们收集、存储您自行主动分享的信息，请联系我们，我们将对上述信息进行删除屏蔽。",1,20,600,-49,[0,"3a3Rslj09FrpLm83WJ7rh2"]]],[1,"2deHhvaAFNL7TZljPscFot",null,null,null,1,0],[1,0,-1106.5,0]],[8,"RichText-001",false,33554432,2,[[2,-50,[0,"64MGKJlxJNRpguOhELP3l+"],[5,600,2231.5],[0,0.5,1]],[4,25,"2. 我们如何使用信息我们严格遵守法律法规、政策规定及监管要求，按照本隐私政策及《用户许可及服务协议》所述使用收集的信息，以向您提供更优质的服务。2.1 我们将基于以下目的和范围，使用您的个人信息：2.1.1 在我们提供服务时，用于用户身份验证、客户服务、安全防范、诈骗检测、存档和备份用途，确保我们向您提供的产品和服务的安全性。2.1.2 向您提供各项功能和服务，包括基础游戏功能、玩家互动功能、消费功能等。2.1.3 帮助我们优化产品，提升服务质量。我们会根据您使用游戏产品的频率和情况、故障信息、性能信息等分析我们产品的运行情况，以确保服务的安全性，并优化我们的产品，提高我们的服务质量。我们不会将存储在分析软件中的信息与您提供的个人身份信息相结合。2.1.4 使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的需求，例如语言设定、位置设定，或对您和其他用户作出其他方面的回应。2.1.5 邀请您参与有关我们产品和服务的调查。2.2 您的实名身份信息、地理位置信息、充值消费记录、生物识别信息等属于您的个人敏感信息。除非为了用于您个人身份验证或安全性的需求，或法律法规的强制要求，我们不会分享、使用您的个人敏感信息。2.3 除了您使用第三方账号登录游戏的情形外，我们不会主动从第三方获取您的个人信息。如未来为业务发展需要需要从第三方调研机构收集游戏调研信息以帮助我们改进游戏产品，我们将会严格遵守相关法律法规规定和政策监管要求，要求该第三方征得您的同意并确保其提供的信息的合法性。2.4 若我们根据本隐私政策收集的您的个人信息的目的、方式发生变更，或使用超出直接或合理关联的范围，我们将在收集或使用您的个人信息前，通过页面提示、交互流程、网站公告、提醒阅读等方式及时通知您，以获得您的重新授权。3.您的权利在您使用我们产品或服务期间，我们可能会视游戏产品具体情况为您提供相应的操作设置，以便您可以访问、查询、更正、删除您的个人信息，或撤回您的相关授权，您可参考相应游戏产品的具体指引进行操作，或按照本隐私政策指引进行操作。此外，我们还设置了投诉举报渠道，您的意见将会得到及时的处理。3.1 访问您的个人信息您可以随时访问和查看您的个人信息。3.2 更正您的个人信息3.2.1 当您发现我们处理关于您的个人信息有错误或者您有其他修改、补充需求时，您可以通过产品相应页面进行修改，也可以通过联系我们要求我们更正。3.2.1 请您注意，游戏账号名称是您重要的网络身份标识，出于安全性和身份识别的考虑，在注册之后无法变更。3.3 删除您的个人信息3.3.1 在以下情形中，您可以向我们提出删除个人信息的请求，请通过本隐私政策列明的联系方式与我们联系，也可以通过注销账户删除您的个人信息：（1）如果我们处理个人信息的行为违反法律法规或政策监管要求；（2）如果我们收集、使用您的个人信息，却未征得您的同意;（3）如果我们处理个人信息的行为违反了与您的约定；（4）如果您不再使用我们的产品或服务，或您注销了账号；3.3.2 当您自行删除或我们协助您删除相关信息后，因为适用的法律法规和安全技术，我们可能不会立即在备份系统中删除相应的信息，但我们会采取合理措施，将您的个人信息匿名化处理，或不可撤销地永久取消我们全部员工和我们授权的全部第三方（如有）对您个人信息的访问权限，同时将相关信息安全存储。3.3.3 请您注意，下列个人信息是我们产品和服务所需的基本信息，如果您不注销账号，则不能单独要求删除，如果信息有误或发生变更，您可以要求修改。如果您坚持要求删除下列信息，您可以注销账号。（1）完成创建账号所填写的信息。包括您的姓名、手机号码、身份证号码。如您是未成年人，还包括您的监护人注册信息和监护关系证明。因为这些信息是我们判断您身份的基本依据。（2）在交易过程中收集的您的虚拟财产相关信息（仅限交易记录、虚拟货币、虚拟交易、游戏兑换码）。因为这些信息是后续服务可能产生争议时判断责任的基本依据。（3）当您使用我们的客户服务时，我们保存您的通信/通话记录和内容或您留下的联系方式。因为这些信息是我们向您提供某些特定客户服务的基本证据和后续继续提供服务的必要信息。3.4 更改您授权同意的范围您在为实现某些游戏产品功能或服务所需而给予我们的授权收集的相应个人信息（例如希望与附近玩家互动而授权收集的地理位置信息），您可以根据您的实际需要，更改您授权同意的范围。您访问、修改和删除个人信息的范围取决于您使用的具体服务及移动设备的设置。请参考移动设备设置的相关说明。（例如，以华为手机为例，您可以在“设置-隐私-权限管理-应用”中管理您的全部授权。）3.5 注销账号3.5.1 如您不再使用我们的产品或服务，您可以进行注销操作。您可以通过本隐私政策尾部的联系方式向我们提出账号注销申请。您提出申请时，应当向我们提供完整、正确的账号注册信息（包括但不限于账号注册信息、实名身份信息），将账号或账号绑定的游戏角色中的虚拟货币消耗完毕，解绑账号密码保护措施。我们验证您的身份及审核您符合上述全部条件后，按照相关法规为您注销账号。3.5.2 账号注销后，我们将对您的全部个人信息进行删除或匿名化处理。该注销账号下的所有内容、信息、记录将会被删除或匿名化处理，您无法再检索、访问、获取、继续使用和找回，也无权要求我们找回（但法律法规或监管部门另有要求的除外）。3.5.3 账号注销后，我们有权不再为您提供任何该账户有关的服务，您与我们曾签署过的相关用户协议、其他权利义务性文件等相应终止（但我们与您之间已约定继续生效的或法律法规另有规定的除外）；3.5.4 您申请账号注销的行为即表明您自愿放弃该账号下的利益，在注销前，请再三确认该账号下的相关交易已完成，避免账号注销后因无法登录而造成不必要损失。因注销账户所带来的不便或不利后果，由您自行承担。3.5.5 如果账号注销期间存在权属纠纷，我们有权终止注销申请。3.5.6 账号注销期间取消注销申请后，需要间隔7天后方可再次申请注销。3.5.7 请您理解并知悉，如您是通过第三方账号进入游戏的用户，我们无权限注销您的第三方账号。如需注销第三方账号，请您根据该第三方账号注销指引进行，我们不参与第三方账号注销流程，亦不对第三方账号注销途径的有效性、第三方账号注销成功与否作出任何承诺或保证。3.6 响应您的上述请求如您发现我们可能违反法律法规的规定，相关政策监管要求，或超出本隐私政策的范围收集、使用您的个人信息，您可以要求我们删除。如您发现我们收集、存储您的个人信息有误的，您也可以要求我们更正。",1,20,600,-51,[0,"44Qkli9lVOFYHZ4DPvVuqf"]]],[1,"88QdtKjC5Obo8rmLx0LOjl",null,null,null,1,0]],[5,"RichText-002",false,33554432,2,[[2,-52,[0,"dbnyvzfnlAiKTloi85iza9"],[5,600,2506.5],[0,0.5,1]],[4,25,"4.信息存储4.1 信息存储的方式和期限4.1.1 我们会通过安全的方式存储您的信息，包括本地存储（例如利用APP进行数据缓存）、数据库和服务器日志，且仅限中国境内存储。4.1.2 在您使用我们产品及/或服务期间，我们会根据法律规定持续保存用户的个人信息。4.1.3 一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。根据相关法规要求，我们将保存您的消费记录自您购买之日起180 天。对于其他数据的保存期限，我们承诺将是为了实现我们产品及/或服务目的所必需的最短期限。在超出上述期限后，我们会对您的相关信息进行删除或匿名化处理。4.2 信息存储的地域我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。未经您的另行同意及相关政府部门的审批，我们不会跨境传输或存储您的个人信息。4.3 产品或服务停止运营时的通知当我们的产品或服务发生停止运营的情况时，我们将根据相关法律法规规定进行公告通知，并依法保障您的合法权益。5. 我们如何保护您的个人信息5.1 我们努力为用户的信息安全提供保障，以防止信息的泄露、丢失、不当使用、未经授权访问和披露等。我们使用多方位的安全保护措施，以确保用户的个人信息保护处于合理的安全水平，包括技术保护手段、管理制度控制、安全体系保障等诸多方面。5.2 我们采用多重技术保护措施保护您的个人信息安全，包括但不限于防火墙、加密（例如SSL）、脱敏、去标识化或匿名化处理、访问控制措施、账户多重认证等。此外，我们还会不断加强安装在您设备端的软件的安全能力。例如，我们会在您的设备本地完成部分信息加密工作，以巩固安全传输；我们会了解您设备安装的应用信息和运行的进程信息，以预防病毒、木马等恶意程序。5.3 我们会审查信息收集、存储和处理方面的做法（包括物理性安全措施），以避免遭到未经授权的访问。5.4 我们建立了保障个人信息安全专门的管理制度、流程和组织。我们只允许那些为了帮我们处理个人信息而需要知晓这些信息的员工、承包商和代理商访问个人信息，而且他们需要履行严格的合同保密义务，如果其未能履行这些义务，就可能会被追究法律责任或被终止其与我们的关系。5.5 我们收集的用户个人信息，除用于必要的身份验证外，将采取匿名化、去标识化处理，避免任何人（包括与我们合作的第三方）识别出您的个人身份，保障隐私安全。5.6 请您理解，互联网并非绝对安全的环境。您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。我们建议您在使用产品和服务时充分注意对个人信息的保护，我们也会提供多种安全功能来协助您保护自己的个人信息安全。除非我们明确要求，我们强烈建议您不要向任何人发送个人信息。请使用复杂密码，协助我们保证您的账号安全。如果我们明确要求您在提交特定服务需求时，使用电子邮件等方式发送个人信息，我们将按照本隐私政策的要求，采取合理可行的措施，保护您发送的个人信息。5.7 若发生个人信息泄露等安全事件，例如我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏。我们会启动应急预案，阻止安全事件扩大。安全事件发生后，我们会以公告或邮件等形式告知您安全事件的基本情况、我们即将或已经采取的处置措施和补救措施，以及我们对您的应对建议。如果难以实现逐一告知，我们将通过公告等方式发布警示。6. 我们如何分享、转让、披露您的个人信息6.1 目前，除本隐私政策以及《用户许可及服务协议》规定的情形之外，我们不会主动共享、提供或转让您的个人信息至公司外的第三方，如存在其他共享、提供或转让您的个人信息或您需要我们将您的个人信息共享、提供或转让至公司外的第三方情形时，我们会直接或确认该第三方征得您对上述行为的明示同意。6.2 您同意，为实现更好的服务，我们可能将您的不带有个人标识或身份识别的个人信息与我们的关联公司、合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出电子邮件、为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在的法域），用作下列用途：6.2.1 向您提供我们的服务；6.2.2 实现“我们可能如何使用信息”部分所述目的；6.2.3 履行我们在本隐私政策中的义务和行使我们的权利；6.2.4 理解、维护和改善我们的服务。6.3如我们与任何上述第三方分享您的个人信息，我们将会采用加密、匿名化、去标识化等手段保障您的信息安全和个人隐私，同时将努力确保该等第三方在使用您的个人信息时遵守本隐私政策及我们要求其遵守的其他适当的保密和安全措施，以保障您的个人信息安全。6.4 除本隐私政策以及《用户许可及服务协议》另有规定外，我们不会对外公开披露所收集的个人信息。如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。6.5 在涉及我们收购、兼并、破产清算、重组等变更时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司或组织继续履行本隐私政策项下的责任和义务。如变更后的主体需变更个人信息使用目的，我们会要求其事先获得您的明示同意。6.6 除此之外，我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：6.6.1 事先获得您明确的同意或授权；6.6.2 根据适用的法律法规、法律程序的要求、强制性的行政或司法要求而必须进行提供；6.6.3 根据与您签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定而提供；6.7 根据相关法律法规及政策监管要求，以下情形中，我们可能会收集、使用、共享、转让、公开披露个人信息无需事先征得您的授权同意：6.7.1 与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；6.7.2 与犯罪侦查、起诉、审判和判决执行等直接相关的；6.7.3 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；6.7.4 您自行向社会公众公开个人信息的；6.7.5 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；6.7.6 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；6.7.7 法律法规规定的其他情形。7.网络信标和相关技术7.1我们或我们的第三方合作伙伴，可能通过网络信标或其他相关技术收集和使用您的信息，并将该等信息储存为日志信息。我们使用自己的网络信标，目的是为您提供更优质的用户体验和服务，并用于以下用途：7.1.1记住您的身份。例如：网络信标有助于我们辨认您作为我们的用户的身份，或保存您向我们提供的有关您的喜好或其他信息；7.1.2分析您使用我们服务的情况。7.2我们为上述目的使用网络信标的同时，可能将收集的非个人身份信息，经统计加工后提供给其他合作伙伴，用于分析用户如何使用我们的服务。7.3我们的产品和服务上可能会有其他合作方放置的网络信标。这些网络信标不受本隐私政策约束，而是受相关使用者的隐私政策约束。7.4 邮件和信息传递您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。7.5 与服务有关的公告我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。8.未成年人/儿童保护8.1 我们高度重视未成年人个人信息的保护问题，并持续探索更新的未成年人个人信息保护方式。",1,20,600,-53,[0,"f9Lcl97DdEvIiq5908QsW4"]]],[1,"c3FGjpzE9PZ6Yipy09RRkX",null,null,null,1,0],[1,0,-2231.5,0]],[5,"RichText-004",false,33554432,2,[[2,-54,[0,"a8A2wq/ghAiLIRmpLs0oEO"],[5,600,2631.5],[0,0.5,1]],[4,25,"8.2 我们会积极按照国家防沉迷政策要求，通过启用防沉迷系统保护未成年人的合法权益。我们会通过实名身份等信息校验判断相关账号的实名信息是否为未成年人，进而决定是否将此账号纳入到防沉迷体系中。另外，我们会收集您的登录时间、游戏时长等信息，通过从系统层面自动干预和限制未成年人游戏时间、启用强制下线功能等方式，引导未成年人合理游戏，并在疑似未成年人消费后尝试联系其监护人进行提醒、确认与处理，帮助未成年人健康上网。8.3 我们还可能会通过收集您在游戏过程中产生的游戏行为数据（如您在终端设备操作游戏时形成的点击压力和半径、点击相对位置、加速度方向、重力方向等数据，以及您在游戏中通过在线语音等方式与其他玩家进行互动时产生的语音数据）来初步判断您是否是未成年人（就语音数据而言，仅是系统随机通过您的部分在线语音来判断是儿童音还是成人音）。8.4 若您是未成年人的法定监护人，请您关注您所监护的未成年人是否是在取得您的授权同意之后使用游戏的服务或提供其个人信息。如果您对您所监护的未成年人的个人信息有疑问，请通过第11节中的联系方式与我们联系。9. 变更我们可能会适时对本隐私政策进行修订。当本隐私政策的条款发生变更时，我们会在版本更新时以网站公告、提醒阅读、弹窗等方式向您提示变更后的隐私政策。请您仔细阅读变更后的隐私政策内容，您继续使用游戏表示您同意我们按照更新后的隐私保护指引收集、处理或使用您的个人信息。如您不同意变更后的内容，我们建议您停止使用我们的产品和服务。10. 独立第三方及其SDK10.1 为实现产品或服务的某些功能，我们的产品或服务可能接入、集成第三方插件、代码，或SDKSoftware Development Kit，软件开发工具包），或链接到第三方网站，或允许您将我们产品或服务的部分内容分享到第三方网站或者应用。此种情形下，我们将不会和独立第三方分享您提供给我们的个人信息，但是请您知悉，独立第三方可能单独收集、使用、储存和分享您的个人信息，第三方对您的个人信息的单独收集、使用、储存和分享行为将适用该第三方自己的隐私政策而不是本隐私政策。请您仔细阅读该等隐私政策，如果您对其存在疑问，您可以通过他们的官网链接联系他们。我们将不会为第三方对您的个人数据收集、使用、储存和分享行为及其后果承担任何责任。10.2 我们接入的独立第三方列表，以及独立第三方收集的信息、开启的权限和相关的目的，如下表所示：序号\tSDK    名称\t收集的信息范围\t实现的功能目的\t所属公司\t官网链接\t\t\t\t\t\t\t\t\t\t1\tBugly SDK\t设备标识信息，游戏数据\t用于收集异常数据、运营数据，保障网络安全\t深圳市腾讯计算机系统有限公司\thttps://privacy.qq.com/document/priview/fbd2c3f898df4c1c869925dd49d578272\tMTP SDK\t游戏账号、游戏内画面、设备信息、运行进程、内外部存储信息\t用于游戏作弊软件和外挂识别和监控、保障网络安全，保障游戏稳定性\t深圳市腾讯计算机系统有限公司\thttps://mtp.qq.com/help_center.shtml#public_protocol.shtml3\t数数 SDK\t用户信息， 设备信息，应用信息、IDFV、AndroidID、操作系统、设备型号、设备制造商、系统版本等、应用版本\t用于识别使用SDK的唯一设备标识、设备型号、系统版本android还是ios版本，用于兼容性适配和问题定位；\t数数信息科技(上海)有限公司\thttps://www.thinkingdata.cn/4\t乐变 SDK\t设备标识信息、游戏版本信息\t用于提供游戏更新服务，保障网络及运营安全\t南京卓望信息科技有限公司\thttps://www.lbstreaming.com/5\t游密\t设备标识信息、声音、音视频信息\t用于访问网络、游戏内对话、上传或保存音视频\t深圳游密科技有限公司\thttps://www.youme.im/privacy-policy.html6\t腾讯云\t设备标识信息\t用于访问网络，保障网络安全\t深圳市腾讯计算机系统有限公司\thttps://cloud.tencent.com/document/product/301/114707\t微信\t设备标识信息\t用于微信账号登录网络服务、帮助用户在应用内使用微信支付，帮助用户分享内容至微信客户端，保障网络及运营安全\t深圳市腾讯计算机系统有限公司\thttps://weixin.qq.com/cgi-bin/readtemplate?lang=zh_CN&t=weixin_agreement&s=privacy8\tQQ\t设备标识信息\t用于QQ账号登录网络服务、帮助用户分享内容至QQ客户端，保障网络及运营安全\t深圳市腾讯计算机系统有限公司\thttps://www.tencent.com/zh-cn/privacy-policy.html9\t支付宝\t设备标识信息\t帮助用户在应用内使用支付宝支付，保障网络及运营安全\t蚂蚁科技集团股份有限公司\thttps://render.alipay.com/p/c/k2cx0tg810\t今日头条广告SDK\t设备标识信息\t信息传递\t北京巨量引擎网络技术有限公司\thttps://www.toutiao.com/privacy_protection/11\tUnity 3D SDK\t手机样式、读取外置存储器\t性能分析\tUnity Technologies\thttps://unity3d.com/legal/privacy-policy11. 联系我们当您有任何需要我们对您的个人信息进行管理，删除、注销等，或有其他的投诉、建议、未成年人个人信息相关问题时，请通过如下方式与我们联系：公司名称：广东五方进通科技有限公司注册地址：广东省东莞市谢岗镇谢岗新城六路7号102室联系邮箱：188774113@qq.com我们将尽快审核所涉问题，并在验证您的用户身份后的十五个工作日内予以回复。特此公告！广东五方进通科技有限公司2025年8月11日未成年人/儿童隐私政策更新日期：2025年8月11日生效日期：2025年8月11日对于不满十四周岁的未成年人（简称“儿童”），我们收集和处理其个人信息除适用《隐私政策》的规定外，还会遵守下列条款。如果下列条款和《隐私政策》不一致，以下列条款的规定为准：1. 儿童个人信息属于敏感信息，我们收集、使用、转移、披露儿童个人信息前，将通过儿童监护人为儿童注册账号时留存的监护人本人联系方式提前通知儿童监护人，并只有获得其同意后才对儿童信息进行收集、使用、转移、披露。2. 儿童监护人收到上述通知后，可以拒绝，如果监护人拒绝我们按照《隐私政策》收集、使用、转移、披露儿童个人信息，我们将不会对儿童信息进行收集、使用、转移、披露，但是，这可能意味着儿童无法完整使用我们产品的部分功能。如果监护人拒绝我们使用的儿童个人信息是运行我们产品所必须的基本信息（儿童的姓名、身份证号码、移动设备号码、设备识别码），儿童将完全无法使用我们的产品。3. 我们工作人员访问儿童个人信息，应当经过儿童个人信息保护负责人或者其授权的管理人员审批，记录访问情况，并采取技术措施，避免违法复制、下载儿童个人信息。4. 儿童监护人代表儿童行使《隐私政策》下儿童本人享有的一切权利，包括《隐私政策》规定的访问、控制、删除儿童个人信息、改变儿童信息授权同意的范围，以及注销儿童的账号。5. 儿童监护人可以撤回对我们收集、使用、转移、披露儿童个人信息的授权，但是这可能意味着儿童无法完整使用我们产品的部分功能。如果监护人撤回授权的儿童个人信息是运行我们产品所必须的基本信息（儿童的姓名、身份证号码、移动设备号码、设备识别码），儿童将完全无法使用我们的产品。6. 我们一般不会向第三方转移儿童个人信息的，如确需第三方转移或委托第三方处理的，我们都会根据法律、行政法规的规定进行合规措施，包括但不限于对第三方进行安全评估。7. 除非法律、行政法规规定应当披露或者根据与您的约定可以披露您孩子的个人信息的，我们不会披露孩子的个人信息。8. 我们如果停止运营产品或服务，会立即停止收集儿童个人信息的活动，删除我们持有的儿童个人信息，并将停止运营的通知及时告知儿童监护人。9. 当您有任何儿童个人信息的问题、投诉、建议时，您可以通过发送邮件至188774113@qq.com，我们将尽快审核所涉问题，并在验证您的用户身份后的十五个工作日内予以回复。",1,20,600,-55,[0,"6ayquqCxZP0bHb88gx4IIW"]]],[1,"40GfGc/LdJC4mLLG/9UA5O",null,null,null,1,0],[1,0,-4738,0]],[10,1,0,9,[0,"887CToSOJDYqTPPnLhZlZ6"]]],0,[0,6,1,0,0,1,0,0,1,0,7,2,0,8,10,0,0,1,0,-1,3,0,0,2,0,0,2,0,-1,11,0,-2,12,0,-3,13,0,-4,14,0,-5,15,0,0,3,0,0,3,0,-1,8,0,-2,4,0,-3,5,0,0,4,0,0,4,0,9,4,0,0,4,0,0,4,0,0,5,0,0,5,0,-3,10,0,-1,6,0,-2,7,0,0,6,0,0,6,0,0,6,0,10,16,0,11,10,0,0,6,0,-1,9,0,0,7,0,0,7,0,0,7,0,0,7,0,0,8,0,0,8,0,0,8,0,0,9,0,-2,16,0,0,11,0,0,11,0,0,12,0,0,12,0,0,13,0,0,13,0,0,14,0,0,14,0,0,15,0,0,15,0,12,1,2,13,7,55],[0,0,0,0,0,0,0,16],[1,2,3,4,5,1,1,1],[0,0,1,2,3,4,5,6]]
